app/Controllers/Absences.php

    public function index()
    {
        $absModel = new Absence();
        if (session()->get('role') == 'admin') {
            $data = $absModel->select('absences.*, users.name')
                ->join('users', 'users.id = absences.user_id')
                ->orderBy('created_at', 'DESC')
                ->findAll();
---
SELECT `absences`.*, `users`.`name`
FROM `absences`
JOIN `users` ON `users`.`id` = `absences`.`user_id`
ORDER BY `created_at` DESC