app/Controllers/Announcements.php

        }

        $users = $currentRole === 'admin'
            ? (new User())->where('role !=', 'admin')->orderBy('name', 'ASC')->findAll()
---
SELECT *
FROM `users`
WHERE `role` != 'admin'
ORDER BY `name` ASC

    private function syncAbsenceAlerts(): void
    {
        $shiftModel = new Shift();
        $attendanceModel = new Attendance();
        $announcementModel = new AnnouncementModel();

        $shifts = $shiftModel->select('shifts.*, users.name as user_name, schedules.name as schedule_name')
            ->join('users', 'users.id = shifts.user_id')
            ->join('schedules', 'schedules.id = shifts.schedule_id', 'left')
            ->where('shifts.user_id IS NOT NULL')
            ->where('shifts.is_active', 1)
            ->where('shifts.status', 'approved')
            ->where('shifts.end_time <', date('Y-m-d H:i:s'))
            ->orderBy('shifts.start_time', 'DESC')
            ->findAll();

        foreach ($shifts as $shift) {
            $alreadyNotified = $announcementModel->where('category', 'absence_notice')
                ->where('related_shift_id', (int) $shift['id'])
                ->countAllResults() > 0;

            if ($alreadyNotified) {
                continue;
            }

            $hasAttendance = $attendanceModel->where('shift_id', (int) $shift['id'])->countAllResults() > 0;
---
SELECT `shifts`.*, `users`.`name` as `user_name`, `schedules`.`name` as `schedule_name`
FROM `shifts`
JOIN `users` ON `users`.`id` = `shifts`.`user_id`
LEFT JOIN `schedules` ON `schedules`.`id` = `shifts`.`schedule_id`
WHERE `shifts`.`user_id` IS NOT NULL
AND `shifts`.`is_active` = 1
AND `shifts`.`status` = 'approved'
AND `shifts`.`end_time` < '2026-04-18 16:14:17'
ORDER BY `shifts`.`start_time` DESC
SELECT COUNT(*) AS `numrows`
FROM `announcements`
WHERE `category` = 'absence_notice'
AND `related_shift_id` = 3
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `shift_id` = 3