app/Controllers/Attendance.php

    public function index()
    {
        $attendanceModel = new AttendanceModel();

        if (session()->get('role') == 'admin') {
            $records = $attendanceModel->select('attendance.*, users.name, shifts.start_time as shift_start_time, shifts.end_time as shift_end_time, qr_points.name as qr_point_name')
                ->join('users', 'users.id = attendance.user_id')
                ->join('shifts', 'shifts.id = attendance.shift_id', 'left')
                ->join('qr_points', 'qr_points.id = attendance.qr_point_id', 'left')
                ->orderBy('check_in', 'DESC')
                ->findAll();
        } else {
            $records = $attendanceModel->select('attendance.*, shifts.start_time as shift_start_time, shifts.end_time as shift_end_time, qr_points.name as qr_point_name')
                ->join('shifts', 'shifts.id = attendance.shift_id', 'left')
                ->join('qr_points', 'qr_points.id = attendance.qr_point_id', 'left')
                ->where('attendance.user_id', session()->get('user_id'))
                ->orderBy('check_in', 'DESC')
                ->findAll();
        }

        $activeShift = $attendanceModel->where('user_id', session()->get('user_id'))
            ->where('check_out', null)
            ->orderBy('check_in', 'DESC')
            ->first();
---
SELECT `attendance`.*, `users`.`name`, `shifts`.`start_time` as `shift_start_time`, `shifts`.`end_time` as `shift_end_time`, `qr_points`.`name` as `qr_point_name`
FROM `attendance`
JOIN `users` ON `users`.`id` = `attendance`.`user_id`
LEFT JOIN `shifts` ON `shifts`.`id` = `attendance`.`shift_id`
LEFT JOIN `qr_points` ON `qr_points`.`id` = `attendance`.`qr_point_id`
ORDER BY `check_in` DESC
SELECT *
FROM `attendance`
WHERE `user_id` = '1'
AND `check_out` IS NULL
ORDER BY `check_in` DESC
 LIMIT 1

    public function checkout()
    {
        $model = new AttendanceModel();
        $activeShift = $model->where('user_id', session()->get('user_id'))->where('check_out', null)->first();
---
SELECT *
FROM `attendance`
WHERE `user_id` = 1
AND `check_out` IS NULL
 LIMIT 1