app/Controllers/BaseController.php

    protected function createAnnouncement(
        string $title,
        string $content,
        int $createdBy,
        ?int $recipientUserId = null,
        ?string $recipientRole = null,
        string $category = 'general',
        ?int $relatedShiftId = null
    ): void {
        $announcementModel = new Announcement();
        $announcementModel->insert([
            'title' => $title,
            'content' => $content,
            'created_by' => $createdBy,
            'recipient_user_id' => $recipientUserId,
            'recipient_role' => $recipientRole,
            'category' => $category,
            'related_shift_id' => $relatedShiftId,
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `announcements` (`title`, `content`, `created_by`, `recipient_user_id`, `recipient_role`, `category`, `related_shift_id`, `created_at`) VALUES ('Inasistencia detectada', 'Elluz Andreina no registró asistencia para el turno \"Madrugada\" programado del 16/04/2026 01:00 al 16/04/2026 07:00.', 1, NULL, 'admin', 'absence_notice', 3, '2026-04-18 16:14:17')

    protected function userHasApprovedAbsenceInRange(int $userId, string $rangeStart, string $rangeEnd): bool
    {
        $absenceModel = new Absence();

        return $absenceModel->where('user_id', $userId)
            ->where('status', 'Aprobado')
            ->where('start_date <=', date('Y-m-d', strtotime($rangeEnd)))
            ->where('end_date >=', date('Y-m-d', strtotime($rangeStart)))
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `absences`
WHERE `user_id` = 3
AND `status` = 'Aprobado'
AND `start_date` <= '2026-04-16'
AND `end_date` >= '2026-04-16'