app/Controllers/Dashboard.php

    public function index()
    {
        if (session()->get('role') == 'admin') {
            $attendanceModel = new Attendance();

            $workingNow = $attendanceModel->select('attendance.*, users.name')
                ->join('users', 'users.id = attendance.user_id')
                ->where('check_out IS NULL')
                ->findAll();
---
SELECT `attendance`.*, `users`.`name`
FROM `attendance`
JOIN `users` ON `users`.`id` = `attendance`.`user_id`
WHERE `check_out` IS NULL

            }

            $userModel = new User();
            $users = $userModel->where('role !=', 'admin')->findAll();
---
SELECT *
FROM `users`
WHERE `role` != 'admin'

    public function getShiftsEvents()
    {
        if (session()->get('role') != 'admin') {
            return $this->response->setJSON([]);
        }

        $shiftModel = new Shift();
        $userModel = new User();
        $shifts = $shiftModel->findAll();

        $userMap = [];
        foreach ($userModel->findAll() as $u) {
---
SELECT *
FROM `shifts`
SELECT *
FROM `users`