app/Controllers/Departments.php

    public function index()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/dashboard');
        $model = new Department();
        return view('departments/index', ['departments' => $model->findAll()]);
---
SELECT *
FROM `departments`