app/Controllers/Objectives.php

SELECT *
FROM `objectives`
SELECT *
FROM `users`
WHERE `role` != 'admin'
SELECT `employee_objectives`.*, `objectives`.`title`, `objectives`.`weight`, `users`.`name`
FROM `employee_objectives`
JOIN `objectives` ON `objectives`.`id` = `employee_objectives`.`objective_id`
JOIN `users` ON `users`.`id` = `employee_objectives`.`user_id`
---
    public function index() {
        if (session()->get('role') != 'admin') return redirect()->to('/dashboard');

        $objModel = new Objective();
        $userModel = new User();

        $objectives = $objModel->findAll();
        $users = $userModel->where('role !=', 'admin')->findAll();

        $db = \Config\Database::connect();
        $assignments = $db->table('employee_objectives')
                          ->select('employee_objectives.*, objectives.title, objectives.weight, users.name')
                          ->join('objectives', 'objectives.id = employee_objectives.objective_id')
                          ->join('users', 'users.id = employee_objectives.user_id')
                          ->get()->getResultArray();