app/Controllers/Performance.php

SELECT *
FROM `performance_evaluations`
ORDER BY `id` DESC
SELECT `employee_evaluations`.*, `performance_evaluations`.`name` as `eval_name`, `users`.`name` as `user_name`
FROM `employee_evaluations`
JOIN `performance_evaluations` ON `performance_evaluations`.`id` = `employee_evaluations`.`evaluation_id`
JOIN `users` ON `users`.`id` = `employee_evaluations`.`user_id`
---
    public function index()
    {
        $perfModel = new PerformanceEvaluation();
        $evaluations = $perfModel->orderBy('id', 'DESC')->findAll();

        $db = \Config\Database::connect();

        if (session()->get('role') == 'admin') {
            $results = $db->table('employee_evaluations')
                ->select('employee_evaluations.*, performance_evaluations.name as eval_name, users.name as user_name')
                ->join('performance_evaluations', 'performance_evaluations.id = employee_evaluations.evaluation_id')
                ->join('users', 'users.id = employee_evaluations.user_id')
                ->get()->getResultArray();