app/Controllers/QrPoints.php

SELECT *
FROM `qr_points`
ORDER BY `name` ASC
---
    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Acceso denegado');
        }

        $points = (new QrPoint())->orderBy('name', 'ASC')->findAll();