app/Controllers/Schedules.php

    public function index()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/dashboard');

        $model = new Schedule();
        $schedules = $model->findAll();
---
SELECT *
FROM `schedules`