app/Controllers/Shifts.php

SELECT `shifts`.*, `users`.`name`, `schedules`.`name` as `schedule_name`
FROM `shifts`
LEFT JOIN `users` ON `users`.`id` = `shifts`.`user_id`
LEFT JOIN `schedules` ON `schedules`.`id` = `shifts`.`schedule_id`
ORDER BY `shifts`.`start_time` DESC
SELECT *
FROM `users`
WHERE `role` != 'admin'
AND `is_active` = 1
SELECT *
FROM `schedules`
ORDER BY `name` ASC
---
    public function admin()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->back()->with('error', 'Acceso denegado');
        }

        $shiftModel = new Shift();
        $userModel = new User();
        $scheduleModel = new Schedule();

        $shifts = $shiftModel->select('shifts.*, users.name, schedules.name as schedule_name')
            ->join('users', 'users.id = shifts.user_id', 'left')
            ->join('schedules', 'schedules.id = shifts.schedule_id', 'left')
            ->orderBy('shifts.start_time', 'DESC')
            ->findAll();

        $users = $userModel->where('role !=', 'admin')->where('is_active', 1)->findAll();
        $schedules = $scheduleModel->orderBy('name', 'ASC')->findAll();