app/Controllers/Users.php

SELECT `users`.*, `departments`.`name` as `department_name`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
ORDER BY `role` ASC, `users`.`name` ASC
SELECT *
FROM `departments`
---
    public function index()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Acceso denegado');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $builder->select('users.*, departments.name as department_name');
        $builder->join('departments', 'departments.id = users.department_id', 'left');
        $builder->orderBy('role', 'ASC')->orderBy('users.name', 'ASC');

        $deptModel = new Department();

        return view('users/index', [
            'users' => $builder->get()->getResultArray(),
            'departments' => $deptModel->findAll(),
        ]);